---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FieldValues Properties
FieldValues Class See Also Send Feedback
---

The FieldValues type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FieldValues Class

Autodesk.Revit.DB.Analysis Namespace